# Lecture 7 - Functions, Pandas, Data Cleaning, and Preparation

In this lecture we will talk more about:
    
- Functions in Python
- Pandas Dataframes

## Functions in Python

In [1]:
def doubleNum(nb):
    num=nb*2 
    return num

number = 3
print("The double is", doubleNum(number))

The double is 6

In [2]:
number = 4
print("The double is", (lambda x: x*2)(number))

The double is 8

## Pandas

This tutorial has been adapted from the creator of [Pandas, Wes McKinney](https://github.com/wesm/pydata-book).

In [1]:
import numpy as np
import pandas as pd

# Remember to always import pandas

## Data loading

Last time, and in Lab 3, we talked about loading data in Python using pandas.

Let's talk now about how to clean and prepare data using Pandas.

## Handling Missing Data

In [7]:
string_data = pd.DataFrame(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data
string_data.isnull()

       0
0  False
1  False
2   True
3  False

In [9]:
string_data[0] = None
string_data
string_data.isnull()

      0
0  True
1  True
2  True
3  True

### Filtering Out Missing Data

In [45]:
from numpy import nan as NA
data = pd.DataFrame([1, NA, 3.5, NA, 7])
data

     0
0  1.0
1  NaN
2  3.5
3  NaN
4  7.0

In [46]:
data.dropna()

     0
0  1.0
2  3.5
4  7.0

In [14]:
data[data.notnull()]

     0
0  1.0
1  NaN
2  3.5
3  NaN
4  7.0

In [16]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [18]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [20]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.536013       NaN       NaN
1  0.504373       NaN       NaN
2 -1.876161       NaN -0.054568
3 -0.773348       NaN  0.447806
4 -0.821009 -0.698881 -0.728584
5  1.492867  0.646390  0.035968
6  0.697265 -0.997848  0.346165

In [22]:
df.dropna()

          0         1         2
4 -0.821009 -0.698881 -0.728584
5  1.492867  0.646390  0.035968
6  0.697265 -0.997848  0.346165

In [23]:
#Keep only the rows with at least 2 non-NA values.
df.dropna(thresh=2)

          0         1         2
2 -1.876161       NaN -0.054568
3 -0.773348       NaN  0.447806
4 -0.821009 -0.698881 -0.728584
5  1.492867  0.646390  0.035968
6  0.697265 -0.997848  0.346165

### Filling In Missing Data

In [24]:
df.fillna(0)

          0         1         2
0  0.536013  0.000000  0.000000
1  0.504373  0.000000  0.000000
2 -1.876161  0.000000 -0.054568
3 -0.773348  0.000000  0.447806
4 -0.821009 -0.698881 -0.728584
5  1.492867  0.646390  0.035968
6  0.697265 -0.997848  0.346165

In [25]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.536013  0.500000  0.000000
1  0.504373  0.500000  0.000000
2 -1.876161  0.500000 -0.054568
3 -0.773348  0.500000  0.447806
4 -0.821009 -0.698881 -0.728584
5  1.492867  0.646390  0.035968
6  0.697265 -0.997848  0.346165

In [26]:
df.fillna(0, inplace=True)
df

          0         1         2
0  0.536013  0.000000  0.000000
1  0.504373  0.000000  0.000000
2 -1.876161  0.000000 -0.054568
3 -0.773348  0.000000  0.447806
4 -0.821009 -0.698881 -0.728584
5  1.492867  0.646390  0.035968
6  0.697265 -0.997848  0.346165

In [32]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df
#df.fillna(method='ffill') # forward fill with last valid observation (bfill to fill backward)
df.fillna(method='ffill', limit=2) #number of consecutive NaN values to forward/backward fill

          0         1         2
0 -1.919734  0.906772  0.553094
1  0.359280  0.956146 -0.548050
2  0.493881  0.956146  0.398894
3 -0.229503  0.956146  1.060126
4 -0.104239       NaN  1.060126
5 -0.539548       NaN  1.060126

In [34]:
data = pd.DataFrame([1., NA, 3.5, NA, 7])
data.fillna(data.mean()) #fills NA with data mean value

          0
0  1.000000
1  3.833333
2  3.500000
3  3.833333
4  7.000000

## Data Transformation

### Removing Duplicates

In [47]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [48]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [49]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [51]:
data['v1'] = range(7)
data
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [52]:
data
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [53]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [56]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [57]:
lowercased = data['food'].str.lower()
lowercased
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [58]:
data['food'].str.lower().map(lambda x: meat_to_animal[x])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [68]:
data = pd.DataFrame([1., -999., 2., -999., -1000., 3.])
data

        0
0     1.0
1  -999.0
2     2.0
3  -999.0
4 -1000.0
5     3.0

In [60]:
data.replace(-999, np.nan)

        0
0     1.0
1     NaN
2     2.0
3     NaN
4 -1000.0
5     3.0

In [61]:
data.replace([-999, -1000], np.nan)

     0
0  1.0
1  NaN
2  2.0
3  NaN
4  NaN
5  3.0

In [62]:
data.replace([-999, -1000], [np.nan, 0])

     0
0  1.0
1  NaN
2  2.0
3  NaN
4  0.0
5  3.0

In [72]:
data=data.replace({-999: np.nan, -1000: 0})

In [73]:
data.replace(np.nan, 0)

     0
0  1.0
1  0.0
2  2.0
3  0.0
4  0.0
5  3.0

### Renaming Axis Indexes

In [26]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [75]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [76]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [77]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [78]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [79]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [80]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [101]:
ages = [18, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [102]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [105]:
cats.codes
cats.categories
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [107]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [108]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [111]:
data = np.random.rand(20)
data
pd.cut(data, 4, precision=2)

[(0.22, 0.44], (0.44, 0.66], (0.66, 0.88], (0.0017, 0.22], (0.0017, 0.22], ..., (0.0017, 0.22], (0.22, 0.44], (0.66, 0.88], (0.66, 0.88], (0.44, 0.66]]
Length: 20
Categories (4, interval[float64]): [(0.0017, 0.22] < (0.22, 0.44] < (0.44, 0.66] < (0.66, 0.88]]

In [114]:
data = np.random.randn(1000)  # Normally distributed
cats = pd.qcut(data, 10)  # Cut into quartiles
cats
pd.value_counts(cats)

(-3.348, -1.181]     100
(-1.181, -0.812]     100
(-0.812, -0.507]     100
(-0.507, -0.247]     100
(-0.247, -0.0101]    100
(-0.0101, 0.286]     100
(0.286, 0.572]       100
(0.572, 0.871]       100
(0.871, 1.343]       100
(1.343, 2.742]       100
dtype: int64

In [124]:
cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])
pd.value_counts(cats)

(0.0944, 0.355]                   8
(0.355, 0.808]                    8
(0.009000000000000001, 0.0944]    2
(0.808, 0.978]                    2
dtype: int64

### Detecting and Filtering Outliers

In [115]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.047996    -0.011090     0.003267    -0.064959
std       0.985449     1.045642     0.992766     1.014048
min      -3.227665    -2.915992    -3.300015    -3.167149
25%      -0.679543    -0.734091    -0.664169    -0.772963
50%      -0.035012     0.006278    -0.008355    -0.096794
75%       0.605852     0.688833     0.643893     0.661070
max       3.061536     3.492778     3.342154     3.376855

In [117]:
col = data[2]
col[np.abs(col) > 3]

13     3.342154
204   -3.019728
342   -3.050500
354    3.218957
927   -3.075950
974   -3.300015
989    3.017598
Name: 2, dtype: float64

In [118]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
13  -0.526263 -1.770604  3.342154 -0.343321
166 -3.227665 -1.154748 -1.830821 -0.342393
204  0.336853 -1.813954 -3.019728 -2.774164
342  1.056092  0.461904 -3.050500  1.717397
354  0.555154  2.185380  3.218957 -1.167578
477 -0.149626 -1.137465  0.635902 -3.167149
569  0.412539  3.492778  0.103108  0.037361
570  0.067704  3.087697  0.761547 -1.694228
719  3.061536 -0.507750 -1.615427  0.069898
776 -0.972458 -0.086143 -1.012905  3.376855
890  3.020427 -0.591041 -1.554304 -1.237883
927  0.661991  0.814813 -3.075950  0.916780
974  0.204524  0.992904 -3.300015 -0.459743
989  0.215865  0.019498  3.017598 -1.657503

In [119]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.047850    -0.011671     0.003135    -0.065169
std       0.984484     1.043847     0.989528     1.012338
min      -3.000000    -2.915992    -3.000000    -3.000000
25%      -0.679543    -0.734091    -0.664169    -0.772963
50%      -0.035012     0.006278    -0.008355    -0.096794
75%       0.605852     0.688833     0.643893     0.661070
max       3.000000     3.000000     3.000000     3.000000

In [123]:
data.head()
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0 -1.0
1 -1.0 -1.0  1.0 -1.0
2 -1.0  1.0  1.0  1.0
3 -1.0 -1.0  1.0 -1.0
4 -1.0  1.0 -1.0  1.0

### Permutation and Random Sampling

In [127]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df
#sampler = np.random.permutation(5)
#sampler

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [126]:
df
df.take(sampler)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3

In [128]:
df.sample(n=3) #selects 3 random rows(default).

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11

In [129]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

3    6
0    5
0    5
3    6
2   -1
3    6
0    5
0    5
4    4
4    4
dtype: int64

### Computing Indicator/Dummy Variables

In [131]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [132]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

## String Manipulation

### String Object Methods

In [133]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [134]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [136]:
first, second, third = pieces
third
first + '::' + second + '::' + third

'a::b::guido'

In [137]:
'::'.join(pieces)

'a::b::guido'

In [142]:
'guido' in val
val.index(',')
val.find(':')

-1

In [67]:
#val.index(':')

In [144]:
val.count('a')

1

In [148]:
val
#val.replace(',', '::')
val.replace(',', '')

'ab  guido'

### Regular Expressions

In [150]:
import re
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)  #All spaces (space, tab, newline...)

['foo', 'bar', 'baz', 'qux']

In [151]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [152]:
regex.findall(text)

['    ', '\t ', '  \t']

In [153]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}' #r for raw string

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [154]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [155]:
m = regex.search(text)
text[m.start():m.end()]

'dave@google.com'

In [156]:
print(regex.match(text))

None

In [157]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [158]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [159]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [160]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [161]:
print(regex.sub(r'\nUsername: \1, Domain: \2, Suffix: \3', text))

Dave
Username: dave, Domain: google, Suffix: com
Steve
Username: steve, Domain: gmail, Suffix: com
Rob
Username: rob, Domain: gmail, Suffix: com
Ryan
Username: ryan, Domain: yahoo, Suffix: com

### Vectorized String Functions in pandas

In [164]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [165]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [166]:
pattern
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [167]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [170]:
data.str.get(1)
data.str[1]

Dave       a
Steve      t
Rob        o
Wes      NaN
dtype: object

In [171]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object